applications/solvers/cokeCombustionFoam/SegregatedSteps/runs/porousMedia/compareDifferentPe/Pe1e_3/constant/thermo.Solid
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      thermo.Solid;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

coke
{
    molWeight 25; // kg/kmol, no meaningful
    density   2500; //mass density, kg/m3
    kappa     2.466607273; //thermal conductivity, W/m/K, trick: for match the effective kappa
    cp        723.5; //heat cpacity J/kg/K
}

rock
{
    molWeight 100; // kg/kmol, no meaningful
    density   2500; //mass density, kg/m3
    kappa     2.466607273; //thermal conductivity, W/m/K, trick: for match the effective kappa
    cp        723.5; //heat cpacity J/kg/K
}


// ************************************************************************* //
